const message = [
{
    id: 1,
    author: 'Алви',
    text: 'Приветики🥰',
    type: 'входящее',
    time: '12:29'
},

{
    id: 2,
    author: 'hasan',
    text: 'Привет🥰',
    type: 'входящее',
    time: '12:30'
},

{
    id: 3,
    author: 'Абу',
    text: 'Приветик🥰',
    type: 'вход',
    time: '12:31'
},

{
    id: 4,
    author: 'Из',
    text: 'Приветш🥰',
    type: 'входящее',
    time: '12:32'
},

{
    id: 5,
    author: 'Важ',
    text: 'Приветикш🥰',
    type: 'исход',
    time: '12:33'
},
];

console.log(message[3].time)